Case: How to multiply all columns in a dataframe and the results as a new column?

### Pandas version

In [32]:
import pandas as pd

In [43]:
df = pd.DataFrame()
df['A'] = [3.2, 3., 5., 80., 77.]
df['B'] = [3.4, 3., 5., 75., 90.]
df['C'] = [3., 4., 5., 65., 70.]
df.head()

      A     B     C
0   3.2   3.4   3.0
1   3.0   3.0   4.0
2   5.0   5.0   5.0
3  80.0  75.0  65.0
4  77.0  90.0  70.0

In [44]:
df['D'] = df['A']*df['B']*df['C']
df.head()

      A     B     C          D
0   3.2   3.4   3.0      32.64
1   3.0   3.0   4.0      36.00
2   5.0   5.0   5.0     125.00
3  80.0  75.0  65.0  390000.00
4  77.0  90.0  70.0  485100.00

### Dask Version

In [45]:
import dask.dataframe as dd

In [46]:
ddf = dd.from_pandas(df, npartitions=1)

In [47]:
ddf.head()

      A     B     C          D
0   3.2   3.4   3.0      32.64
1   3.0   3.0   4.0      36.00
2   5.0   5.0   5.0     125.00
3  80.0  75.0  65.0  390000.00
4  77.0  90.0  70.0  485100.00

In [48]:
ddf['D'] = ddf['A']*ddf['B']*ddf['C']

In [49]:
ddf.head()

      A     B     C          D
0   3.2   3.4   3.0      32.64
1   3.0   3.0   4.0      36.00
2   5.0   5.0   5.0     125.00
3  80.0  75.0  65.0  390000.00
4  77.0  90.0  70.0  485100.00

Or by function

In [50]:
def function(row, cols=None):
    '''
    This function will multiply all existing columns.
    '''
    result = row[cols[0]]
    for c in range(len(cols)):
        if c != 0:
            result = result*row[cols[c]]
        
    return result

cols = list(ddf.columns)
ddf['result'] = ddf.apply(function, axis=1, cols=cols, meta=bool)
ddf.head()

      A     B     C          D        result
0   3.2   3.4   3.0      32.64  1.065370e+03
1   3.0   3.0   4.0      36.00  1.296000e+03
2   5.0   5.0   5.0     125.00  1.562500e+04
3  80.0  75.0  65.0  390000.00  1.521000e+11
4  77.0  90.0  70.0  485100.00  2.353220e+11